[
  {
    "id": 1,
    "name": "RESTful WebAPIs",
    "author": "O`reilly",
    "userId": 1,
    "chapters": [
      {
        "chapter": 1,
        "name": "Surfing the Web",
        "pages": [
          {
            "number": 1,
            "paragraphs": [
              "The World Wide Web became popular because ordinary people can use it to do really useful things with minimal training. But behind the scenes, the Web is also a powerfulplatform for distributed computing.",
              "The principles that make the Web usable by ordinary people also work when the “user” is an automated software agent. A piece of software designed to transfer money betweenbank accounts (or carry out any other real-world task) can accomplish the task usingthe same basic technologies a human being would use.",
              "As far as this book is concerned, the Web is based on three technologies: the URL naming convention, the HTTP protocol, and the HTML document format. URL and HTTP are simple, but to apply them to distributed programming you must understand them in more detail than the average web developer does. The first few chapters of this book arededicated to giving you this understanding.",
              "The story of HTML is a little more complicated. In the world of web APIs, there are dozens of data formats competing to take the place of HTML. An exploration of these formats will take up several chapters of this book, starting in Chapter 5. For now, I want to focus on URL and HTTP, and use HTML solely as an example.",
              "I’m going to start off by telling a simple story about the World Wide Web, as a way of explaining the principles behind its design and the reasons for its success. The story needs to be simple because although you’re certainly familiar with the Web, you might not have heard of the concepts that make it work. I want you to have a simple, concrete example to fall back on if you ever get confused about terminology like “hypermedia as the engine of application state.”",
              "Let’s get started."
            ]
          },
          {
            "number": 2,
            "paragraphs": [
              "Alice is old enough to remember the mid-1990s, so she recalls the public’s reaction when URLs started showing up on billboards. At first, people made fun of these weird-looking strings. It wasn’t clear what “http://” or “youtypeitwepostit.com” meant. But 20 years later, everyone knows what to do with a URL: you type it into the address bar of your web browser and hit Enter.",
              "And that’s what Alice does: she pulls out her mobile phone and puts http://www.youtypeitwepostit.com/ in her browser’s address bar. The first episode of our story ends on a cliffhanger: what’s at the other end of that URL?",
              "Sorry for interrupting the story, but I need to introduce some basic terminology. Alice’s web browser is about to send an HTTP request to a web server—specifically, to the URL http://www.youtypeitwepostit.com/. One web server may host many different URLs, and each URL grants access to a different bit of the data on the server.",
              "We say that a URL is the URL of some thing: a product, a user, the home page. The technical term for the thing named by a URL is resource.",
              "The URL http://www.youtypeitwepostit.com/ identifies a resource—probably the home page of the website advertised on the billboard. But you won’t know for sure until we resume the story and Alice’s web browser sends the HTTP request."
            ]
          }
        ]
      }
    ]
  },
  {
    "id": 2,
    "name": "Психология Толп",
    "author": "Лебон Г.",
    "chapters": [
      {
        "name": "ПСИХОЛОГИЯ НАРОДОВ",
        "pages": [
          {
            "number": "1",
            "paragraphs": [
              "Идеи, правящие учреждениями народов, претерпевают очень длинную эволюцию. Образуясь очень медленно, они вместе с тем очень медленно исчезают. Став для просвещенных умов очевидными заблуждениями, они еще очень долгое время   остаются неоспоримыми истинами для толпы и продолжают оказывать свое действие на темные народные массы. Если   трудно внушить новую идею, то не менее трудно уничтожить старую. Человечество постоянно с отчаянием цепляется за   мертвые идеи и мертвых богов.",
              "Уже почти полтора века прошло с тех пор, как поэты и философы, крайне невежественные относительно первобыт   ной истории человека, разнообразия его душевного строя и законов наследственности, бросили в мир идею равенства  людей и рас.",
              "Очень обольстительная для масс, эта идея вскоре прочно укрепилась в их душе и не замедлила принести свои плоды. Она потрясла основы старых обществ, произвела одну из страшнейших революций и бросила западный мир в целый ряд  сильных конвульсий, которым невозможно предвидеть конца.",
              "Без сомнения, некоторые из неравенств, разделяющих индивидуумов и расы, были слишком очевидны, чтобы прихо    дилось серьезно их оспаривать; но люди легко успокаивались на том, что эти неравенства — только следствия различия   в воспитании, что все люди рождаются одинаково умными и добрыми и что одни только учреждения могли их развратить. Средство против этого было очень простое: перестроить учреждения и дать всем людям одинаковое воспитание.\n    Таким-то образом учреждения и просвещение стали великими панацеями современных демократий, средством для исправления неравенств, оскорбительных для великих принципов, являющихся единственными божествами современности."
            ]
          }
        ]
      }
    ],
    "userId": 1
  }
]